jamesmunns/kinetis-rs/platform/drivers/enet/src/fsl_enet_driver.c
/*
* Copyright (c) 2013 - 2014, Freescale Semiconductor, Inc.
* All rights reserved.
*
* Redistribution and use in source and binary forms, with or without modification,
* are permitted provided that the following conditions are met:
*
* o Redistributions of source code must retain the above copyright notice, this list
*   of conditions and the following disclaimer.
*
* o Redistributions in binary form must reproduce the above copyright notice, this
*   list of conditions and the following disclaimer in the documentation and/or
*   other materials provided with the distribution.
*
* o Neither the name of Freescale Semiconductor, Inc. nor the names of its
*   contributors may be used to endorse or promote products derived from this
*   software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
* ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
* WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
* DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
* ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
* (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
* LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
* ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
* (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
* SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*/

#include "fsl_enet_driver.h"
#include "fsl_enet_hal.h"
#include "fsl_enet_common.h"
#include "fsl_clock_manager.h"
#include "fsl_interrupt_manager.h"
#include <string.h>

/*******************************************************************************
 * Variables
 ******************************************************************************/
/*! @brief Define global value for ISR input parameter*/
enet_dev_if_t *enetIfHandle[HW_ENET_INSTANCE_COUNT];

#if FSL_FEATURE_ENET_SUPPORT_PTP
/*! @brief Define ptp mastertimer information*/
enet_mac_ptp_master_time_t g_ptpMasterTime;
/*! @brief Define clk frequency for 1588 timer*/
uint32_t g_ptpClkFrq;
#if FSL_FEATURE_ENET_PTP_TIMER_CHANNEL_INTERRUPT_ERRATA_2579
#define ENET_TIMER_CHANNEL_NUM      kEnetTimerChannel3
#endif
#endif

/*******************************************************************************
 * Code
 ******************************************************************************/
#if FSL_FEATURE_ENET_SUPPORT_PTP
/*FUNCTION****************************************************************
 *
 * Function Name: ENET_DRV_1588Init
 * Return Value: The execution status.
 * Description:Initialize the ENET private ptp(Precision Time Synchronization Protocol)
 * data structure.
 *
 *END*********************************************************************/
uint32_t ENET_DRV_1588Init(enet_dev_if_t *enetIfPtr, enet_mac_ptp_ts_data_t *ptpTsRxDataPtr,uint32_t rxBuffNum, 
                        enet_mac_ptp_ts_data_t *ptpTsTxDataPtr, uint32_t txBuffNum, bool isSlaveEnabled)
{
    enet_private_ptp_buffer_t *privatePtpPtr;
    
    /* Check the input parameters */
    if ((!enetIfPtr) || (!ptpTsRxDataPtr) || (!ptpTsTxDataPtr))
    {
        return kStatus_ENET_InvalidInput;
    }

    privatePtpPtr = &enetIfPtr->privatePtp;
    enetIfPtr->privatePtp.firstflag = true;

    /* Initialize ptp receive and transmit ring buffers*/
    privatePtpPtr->rxTimeStamp.ptpTsDataPtr = ptpTsRxDataPtr;
    privatePtpPtr->rxTimeStamp.size = rxBuffNum;
    privatePtpPtr->rxTimeStamp.front = 0;
    privatePtpPtr->rxTimeStamp.end = 0;
    privatePtpPtr->txTimeStamp.ptpTsDataPtr = ptpTsTxDataPtr;
    privatePtpPtr->txTimeStamp.size = txBuffNum;
    privatePtpPtr->txTimeStamp.front = 0;
    privatePtpPtr->txTimeStamp.end = 0;

    /* Start 1588 timer and enable timer interrupt*/
    ENET_DRV_Start1588Timer(enetIfPtr->deviceNumber, isSlaveEnabled);
    return kStatus_ENET_Success;
}

/*FUNCTION****************************************************************
 *
 * Function Name: ENET_DRV_1588Deinit
 * Return Value: The execution status.
 * Description:Initialize the ENET private ptp(Precision Time Synchronization Protocol)
 * data structure.
 *
 *END*********************************************************************/
uint32_t ENET_DRV_1588Deinit(enet_dev_if_t *enetIfPtr)
{
    /* Check the input parameters */
    if (!enetIfPtr)
    {
        return kStatus_ENET_InvalidInput;
    }

    /* Initialize ptp receive and transmit ring buffers*/
    enetIfPtr->privatePtp.rxTimeStamp.ptpTsDataPtr = NULL;
    enetIfPtr->privatePtp.rxTimeStamp.size = 0;
    enetIfPtr->privatePtp.rxTimeStamp.front = 0;
    enetIfPtr->privatePtp.rxTimeStamp.end = 0;
    enetIfPtr->privatePtp.txTimeStamp.ptpTsDataPtr = NULL;
    enetIfPtr->privatePtp.txTimeStamp.size = 0;
    enetIfPtr->privatePtp.txTimeStamp.front = 0;
    enetIfPtr->privatePtp.txTimeStamp.end = 0;

    ENET_DRV_Stop1588Timer(enetIfPtr->deviceNumber);

    return kStatus_ENET_Success;
}


/*FUNCTION****************************************************************
 *
 * Function Name: ENET_DRV_Start1588Timer
 * Return Value: The execution status.
 * Description: Start the ENET ptp(Precision Time Synchronization Protocol)
 * timer. After this, the timer is ready for 1588 synchronization.  
 *
 *END*********************************************************************/
uint32_t ENET_DRV_Start1588Timer(uint32_t instance, bool isSlaveEnabled)
{
    uint32_t clockFreq = 0, baseAddr;
    enet_config_ptp_timer_t ptpCfg;

    /* Check if this is the master ptp timer*/
    if (!isSlaveEnabled)
    {
        g_ptpMasterTime.masterPtpInstance = instance;
    }

    baseAddr = g_enetBaseAddr[instance]; 
    
    /* Initialize ptp timer */
    clockFreq = CLOCK_SYS_GetEnetTimeStampFreq(instance);
    if (!clockFreq)
    {
        return kStatus_ENET_GetClockFreqFail;
    }
    ptpCfg.isSlaveEnabled = isSlaveEnabled;
    ptpCfg.period = kEnetPtpAtperVaule;
    ptpCfg.clockIncease = ptpCfg.period/clockFreq;
    /* Set the gloabl 1588 timer frequency*/
    g_ptpClkFrq = clockFreq;

    ENET_HAL_Set1588TimerStart(baseAddr, &ptpCfg);
#if FSL_FEATURE_ENET_PTP_TIMER_CHANNEL_INTERRUPT_ERRATA_2579
    /* Initialize timer channel for timestamp interrupt for old silicon*/
    uint32_t compareValue = ptpCfg.period - ptpCfg.clockIncease;
    ENET_HAL_Set1588TimerChnCmp(baseAddr, ENET_TIMER_CHANNEL_NUM, compareValue, compareValue);
#endif

