jamesmunns/kinetis-rs/platform/drivers/enet/src/fsl_enet_driver.c
    /* Enable master ptp timer interrupt */
    if (!ptpCfg.isSlaveEnabled)
    {
        ENET_HAL_SetIntMode(baseAddr, kEnetTsTimerInterrupt, true);
        INT_SYS_EnableIRQ(g_enetTsIrqId[instance]);
    }

    return kStatus_ENET_Success;
}

/*FUNCTION****************************************************************
 *
 * Function Name: ENET_DRV_Stop1588Timer
 * Return Value: The execution status.
 * Description:Stop ENET ptp timer. 
 *
 *END*********************************************************************/
void ENET_DRV_Stop1588Timer(uint32_t instance)
{
    uint32_t baseAddr; 

    baseAddr = g_enetBaseAddr[instance]; 
    /* Disable ptp timer*/
    ENET_HAL_Set1588TimerCmd(baseAddr, false);
    ENET_HAL_Set1588TimerRestart(baseAddr);
}

/*FUNCTION****************************************************************
 *
 * Function Name: ENET_DRV_Get1588timer
 * Return Value: The execution status.
 * Description: Get current ENET ptp time. 
 * This interface is use by 1588 stack to get the current value from the ptp timer
 * through ioctl interface.
 *END*********************************************************************/
uint32_t ENET_DRV_Get1588timer(enet_mac_ptp_time_t *ptpTimerPtr)
{
    uint32_t baseAddr;

    /* Check input parameters*/
    if (!ptpTimerPtr)
    {
        return kStatus_ENET_InvalidInput;
    }
    baseAddr = g_enetBaseAddr[g_ptpMasterTime.masterPtpInstance]; 

    /* Interrupt disable*/
    INT_SYS_DisableIRQGlobal();

    /* Get the current value of the master time*/
    ptpTimerPtr->second = g_ptpMasterTime.second;
    ENET_HAL_Set1588TimerCapture(baseAddr);
    /*Bug of IC need repeat*/
    ENET_HAL_Set1588TimerCapture(baseAddr);
    ptpTimerPtr->nanosecond = ENET_HAL_Get1588TimerCurrentTime(baseAddr);

    /* Enable interrupt*/
    INT_SYS_EnableIRQGlobal();

    return kStatus_ENET_Success;
}

/*FUNCTION****************************************************************
 *
 * Function Name: ENET_DRV_Set1588timer
 * Return Value: The execution status.
 * Description: Set ENET ptp time. 
 * This interface is use by 1588 stack to set the current ptp timer
 * through ioctl interface.
 *END*********************************************************************/
uint32_t ENET_DRV_Set1588timer(enet_mac_ptp_time_t *ptpTimerPtr)
{
    uint32_t baseAddr;
    /* Check input parameters*/
    if (!ptpTimerPtr)
    {
        return kStatus_ENET_InvalidInput;
    }

    /* Disable interrupt*/
    INT_SYS_DisableIRQGlobal();
    /* Set ptp timer*/
    g_ptpMasterTime.second = ptpTimerPtr->second;
    baseAddr = g_enetBaseAddr[g_ptpMasterTime.masterPtpInstance]; 
    ENET_HAL_Set1588TimerNewTime(baseAddr, ptpTimerPtr->nanosecond);

    /* Enable interrupt*/
    INT_SYS_EnableIRQGlobal();
    return kStatus_ENET_Success;
}

/*FUNCTION****************************************************************
 *
 * Function Name: ENET_DRV_Adjust1588timer
 * Return Value: The execution status.
 * Description: Adjust ENET ptp timer. 
 * This interface is mainly the adjust algorithm for ptp timer synchronize.
 * this function is used to adjust ptp timer to synchronize with master timer.
 *END*********************************************************************/
uint32_t ENET_DRV_Adjust1588timer(uint32_t instance, int32_t drift)
{
    uint32_t clockIncrease,adjIncrease,corrPeriod = 0,corrIncrease = 0,count = 0;
    uint32_t gapMax = 0xFFFFFFFF,gapTemp,adjPeriod = 1, baseAddr;
    baseAddr = g_enetBaseAddr[instance]; 

    /* Calculate clock period of the ptp timer*/
    clockIncrease = kEnetPtpAtperVaule / g_ptpClkFrq ;

    if (drift != 0)
    {
        if (abs(drift) >= g_ptpClkFrq)
        {
            /* Drift is greater than the 1588 clock frequency the correction should be done every tick of the timer*/   
            corrPeriod = 1;	
            corrIncrease = (uint32_t)(abs(drift)/g_ptpClkFrq);
        }
        else
        {
            /* Drift is smaller than the 1588 clock frequency*/
            if (abs(drift) > (g_ptpClkFrq / clockIncrease))
            {
                adjIncrease = clockIncrease / kEnetBaseIncreaseUnit;
            }
            else if (abs(drift) > (g_ptpClkFrq / (2*kEnetBaseIncreaseUnit*clockIncrease)))
            {
                adjIncrease = clockIncrease / (2*kEnetBaseIncreaseUnit);
                adjPeriod =  kEnetBaseIncreaseUnit;
            }
            else
            {
                adjIncrease = clockIncrease / (2*kEnetBaseIncreaseUnit);
                adjPeriod = 2*kEnetBaseIncreaseUnit;
            }
            for(count = 1; count < adjIncrease; count++)
            {
                gapTemp = (g_ptpClkFrq * adjPeriod * count) % abs(drift);
                if (!gapTemp)
                {
                    corrIncrease = count;
                    corrPeriod = (uint32_t)((g_ptpClkFrq * adjPeriod * count) / abs(drift));
                    break;
                }
                else if (gapTemp < gapMax)
                { 
                    corrIncrease = count;
                    corrPeriod = (uint32_t)((g_ptpClkFrq * adjPeriod * count) / abs(drift));
                    gapMax = gapTemp;
                }
            }
        }
        /* Calculate the clock correction increase value*/
        if (drift < 0)
        {
            corrIncrease = clockIncrease - corrIncrease;
        }
        else
        {
            corrIncrease = clockIncrease + corrIncrease;
        }
        /* Adjust the ptp timer*/	
        ENET_HAL_Set1588TimerAdjust(baseAddr, corrPeriod, corrIncrease);
    }
    else
    {
        /* Adjust the ptp timer*/
        ENET_HAL_Set1588TimerAdjust(baseAddr, 0, clockIncrease);
    }
   
    return kStatus_ENET_Success;
}

/*FUNCTION****************************************************************
 *
 * Function Name: enet_ptp_store_tx_timestamp
 * Return Value: The execution status.
 * Description: Store the transmit ptp timestamp. 
 * This interface is to store transmit ptp timestamp and is called by transmit function.
 *END*********************************************************************/
uint32_t ENET_DRV_GetTxTs(enet_private_ptp_buffer_t *ptpBuffer, volatile enet_bd_struct_t *firstBdPtr, volatile enet_bd_struct_t *lastBdPtr)
{
    bool isPtpMsg,ptpTimerWrap;
    enet_mac_ptp_ts_data_t ptpTsData;
    enet_mac_ptp_time_t ptpTimerPtr;
    uint8_t * bdBufferPtr;
    uint32_t result = kStatus_ENET_Success, baseAddr;

