jamesmunns/kinetis-rs/platform/drivers/enet/src/fsl_enet_driver.c
    /* Check input parameter*/
    if (!ptpBuffer)
    {
        return kStatus_ENET_InvalidInput;
    }
  
    /* Parse the message packet to check if there is a ptp message*/	
    bdBufferPtr = ENET_HAL_GetBuffDescripData(firstBdPtr);
    result = ENET_DRV_Parse1588Packet(bdBufferPtr, &ptpTsData, &isPtpMsg, false);
    if (result != kStatus_ENET_Success)
    {
        return result;
    }

    /* Store transmit timestamp of the ptp message*/
    if (isPtpMsg)
    {
        baseAddr = g_enetBaseAddr[g_ptpMasterTime.masterPtpInstance];
        /* Get transmit timestamp nanosecond*/
        ptpTsData.timeStamp.nanosecond = ENET_HAL_GetBuffDescripTs(lastBdPtr);

        /* Get current ptp timer nanosecond value*/
        ENET_DRV_Get1588timer(&ptpTimerPtr);
        INT_SYS_DisableIRQGlobal();
        
        /* Get ptp timer wrap event*/
        ptpTimerWrap = ENET_HAL_GetIntStatusFlag(baseAddr, kEnetTsTimerInterrupt);

        /* Get transmit timestamp second*/
        if ((ptpTimerPtr.nanosecond > ptpTsData.timeStamp.nanosecond) || 
            ((ptpTimerPtr.nanosecond < ptpTsData.timeStamp.nanosecond) && ptpTimerWrap))
        {
            ptpTsData.timeStamp.second = g_ptpMasterTime.second;
        }
        else 
        {
            ptpTsData.timeStamp.second = g_ptpMasterTime.second - 1;
        }
     
        INT_SYS_EnableIRQGlobal();

        /* Add the new timestamp data into the ptp ring buffer*/
        result = ENET_DRV_Update1588TsBuff(&(ptpBuffer->txTimeStamp), &ptpTsData);
    }

    return result;
}

/*FUNCTION****************************************************************
 *
 * Function Name: ENET_DRV_GetRxTs
 * Return Value: The execution status.
 * Description: Store the receive ptp packet timestamp. 
 * This interface is to store receive ptp packet timestamp and is called by receive function.
 *END*********************************************************************/
uint32_t ENET_DRV_GetRxTs(enet_private_ptp_buffer_t *ptpBuffer, uint8_t *packet, volatile enet_bd_struct_t *bdPtr)
{
    enet_mac_ptp_ts_data_t ptpTsData;
    enet_mac_ptp_time_t ptpTimerPtr;
    bool  isPtpMsg = false, ptpTimerWrap;
    uint32_t result, baseAddr;

    /* Check input parameter*/
    if ((!ptpBuffer) || (!packet) || (!bdPtr))
    {
        return kStatus_ENET_InvalidInput;
    }

    /* Check if the message is a ptp message */
    result = ENET_DRV_Parse1588Packet(packet, &ptpTsData, &isPtpMsg, false);
    if (result != kStatus_ENET_Success)
    {
        return result;
    }

    /* Store the receive timestamp of the ptp message*/
    if (isPtpMsg)
    {
        baseAddr = g_enetBaseAddr[g_ptpMasterTime.masterPtpInstance];

        /* Get the timestamp from the bd buffer*/
        ptpTsData.timeStamp.nanosecond = ENET_HAL_GetBuffDescripTs(bdPtr);

        /* Get current ptp timer nanosecond value*/
        ENET_DRV_Get1588timer(&ptpTimerPtr);

        INT_SYS_DisableIRQGlobal();  
   
        /* Get ptp timer wrap event*/
        ptpTimerWrap = ENET_HAL_GetIntStatusFlag(baseAddr, kEnetTsTimerInterrupt);

        /* Get transmit timestamp second*/
        if ((ptpTimerPtr.nanosecond > ptpTsData.timeStamp.nanosecond) || 
            ((ptpTimerPtr.nanosecond < ptpTsData.timeStamp.nanosecond) && ptpTimerWrap))
        {
            ptpTsData.timeStamp.second = g_ptpMasterTime.second;
        }
        else 
        {
            ptpTsData.timeStamp.second = g_ptpMasterTime.second - 1;
        }	
        INT_SYS_EnableIRQGlobal();

        /* Add the new timestamp data into the ptp ring buffer*/
        result = ENET_DRV_Update1588TsBuff(&(ptpBuffer->rxTimeStamp), &ptpTsData);

    }
        
    return result;
}

/*FUNCTION****************************************************************
 *
 * Function Name: ENET_DRV_Parse1588Packet
 * Return Value: The execution status.
 * Description: Parse the message and store the ptp message information if 
 * it is a ptp message. this is called by the tx/rx store timestamp interface. 
 *
 *END*********************************************************************/
uint32_t ENET_DRV_Parse1588Packet(uint8_t *packet, enet_mac_ptp_ts_data_t *ptpTsPtr, 
                         bool *isPtpMsg, bool isFastEnabled)
{   
    uint8_t *buffer = packet;
    uint16_t ptpType;

    /* Check input parameter*/
    if((!packet) || (!isPtpMsg) || ((!ptpTsPtr) && (!isFastEnabled)))
    {
        return kStatus_ENET_InvalidInput;
    }
    
    *isPtpMsg = false;

    /* Check for vlan frame*/
    if (*(uint16_t *)(buffer + kEnetPtpEtherL2PktTypeOffset) == HTONS(kEnetProtocol8021QVlan))
    {
        buffer += (sizeof(enet_8021vlan_header_t) - kEnetEthernetHeadLen);
    }

    ptpType = *(uint16_t *)(buffer + kEnetPtpEtherL2PktTypeOffset);
    switch(HTONS(ptpType))
    {
        case kEnetProtocoll2ptpv2:
            if (*(uint8_t *)(buffer + kEnetPtpEtherL2MsgTypeOffset) <= kEnetPtpEventMsgType)
            {
                /* Set the ptp message flag*/
                *isPtpMsg = true; 
                if(!isFastEnabled)
                {
                    /* It's a ptpv2 message and store the ptp header information*/
                    ptpTsPtr->version = (*(uint8_t *)(buffer + kEnetPtpEtherL2VersionOffset))&0x0F;
                    ptpTsPtr->messageType = (*(uint8_t *)(buffer + kEnetPtpEtherL2MsgTypeOffset))& 0x0F;
                    ptpTsPtr->sequenceId = HTONS(*(uint16_t *)(buffer + kEnetPtpEtherL2SequenceIdOffset));
                    memcpy((void *)&ptpTsPtr->sourcePortId[0],(void *)(buffer + kEnetPtpEtherL2ClockIdOffset),kEnetPtpSourcePortIdLen);
                }
            }
        break;

        case kEnetProtocolIpv4:
            if ((*(uint8_t *)(buffer + kEnetPtpIpVersionOffset) >> 4 ) == kEnetPacketIpv4Version)
            {
                if (((*(uint16_t *)(buffer + kEnetPtpIpv4UdpPortOffset)) == HTONS(kEnetPtpEventPort))&&
                (*(uint8_t *)(buffer + kEnetPtpIpv4UdpProtocolOffset) == kEnetPacketUdpVersion))
                {
                    /* Set the ptp message flag*/
                    *isPtpMsg = true;  
                    if(!isFastEnabled)
                    {
                        /* It's a IPV4 ptp message and store the ptp header information*/
                        ptpTsPtr->version = (*(uint8_t *)(buffer + kEnetPtpIpv4UdpVersionoffset))&0x0F;
                        ptpTsPtr->messageType = (*(uint8_t *)(buffer + kEnetPtpIpv4UdpMsgTypeOffset))& 0x0F;
                        ptpTsPtr->sequenceId = HTONS(*(uint16_t *)(buffer + kEnetPtpIpv4UdpSequenIdOffset));
                        memcpy(( void *)&ptpTsPtr->sourcePortId[0],( void *)(buffer + kEnetPtpIpv4UdpClockIdOffset),kEnetPtpSourcePortIdLen);
                    }
                }
            }        
        break;
        case kEnetProtocolIpv6:
            if ((*(uint8_t *)(buffer + kEnetPtpIpVersionOffset) >> 4 ) == kEnetPacketIpv6Version)
            {
                if (((*(uint16_t *)(buffer + kEnetPtpIpv6UdpPortOffset)) == HTONS(kEnetPtpEventPort))&&
                  (*(uint8_t *)(buffer + kEnetPtpIpv6UdpProtocolOffset) == kEnetPacketUdpVersion))
                {
                    /* Set the ptp message flag*/
                    *isPtpMsg = true;
                    if(!isFastEnabled)
                    {
                        /* It's a IPV6 ptp message and store the ptp header information*/
                        ptpTsPtr->version = (*(uint8_t *)(buffer + kEnetPtpIpv6UdpVersionOffset))&0x0F;
                        ptpTsPtr->messageType = (*(uint8_t *)(buffer + kEnetPtpIpv6UdpMsgTypeOffset))& 0x0F;
                        ptpTsPtr->sequenceId = HTONS(*(uint16_t *)(buffer + kEnetPtpIpv6UdpSequenceIdOffset));
                        memcpy(( void *)&ptpTsPtr->sourcePortId[0],( void *)(buffer + kEnetPtpIpv6UdpClockIdOffset),kEnetPtpSourcePortIdLen);
                    }  
                }
            }
        break;
        default:
        break;

