jamesmunns/kinetis-rs/platform/drivers/enet/src/fsl_enet_driver.c
    }

    return kStatus_ENET_Success;
}

/*FUNCTION****************************************************************
 *
 * Function Name: enet_ptp_l2queue_init
 * Return Value: The execution status.
 * Description: Initialize dara buffer queue for ptp Ethernet layer2 packets.
 *END*********************************************************************/
uint32_t ENET_DRV_1588l2queueInit(enet_dev_if_t *enetIfPtr, enet_mac_ptp_l2buffer_t *ptpL2BufferPtr,
                                       uint32_t ptpL2BuffNum)
{
    uint32_t index;
    enet_mac_ptp_l2buffer_queue_t *ptpL2queuePtr;
    /* Check input parameters*/
    if ((!enetIfPtr) || (!ptpL2BufferPtr))
    {
        return kStatus_ENET_InvalidInput;
    }

    ptpL2queuePtr = &enetIfPtr->privatePtp.layer2Queue;

    /* Initialize the queue*/
    ptpL2queuePtr->l2bufferPtr = ptpL2BufferPtr;
    ptpL2queuePtr->l2bufferNum = ptpL2BuffNum;
    ptpL2queuePtr->writeIdx = 0;
    ptpL2queuePtr->readIdx = 0;
    for (index = 0; index < ptpL2BuffNum; index++)
    {
        ptpL2queuePtr->l2bufferPtr[index].length = 0;
    }

    return kStatus_ENET_Success;
}

/*FUNCTION****************************************************************
 *
 * Function Name: ENET_DRV_Service_2packet
 * Return Value: The execution status.
 * Description: Add the ptp layer2 Ethernet packet to the queue.
 * This interface is the call back for Ethernet 1588 layer2 packets to 
 * add queue for ptp layer2 Ethernet packets. 
 *END*********************************************************************/
uint32_t ENET_DRV_Service_l2packet(enet_dev_if_t * enetIfPtr, enet_mac_packet_buffer_t *packBuffer)
{
    enet_mac_ptp_l2buffer_queue_t * ptpQuePtr;
    uint16_t type, length = 0;
    enet_mac_packet_buffer_t *frame;
    /* Check input parameter*/
    if ((!enetIfPtr) || (!packBuffer))
    {
        return kStatus_ENET_InvalidInput;
    }
    ptpQuePtr = &enetIfPtr->privatePtp.layer2Queue;

    if(!ptpQuePtr->l2bufferPtr)
    {
        return kStatus_ENET_Layer2UnInitialized;
    }
    /* Check for protocol type*/
    type = ((enet_ethernet_header_t *)(packBuffer->data))->type;
    if(HTONS(type) == kEnetProtocol8021QVlan)
    {
        type = ((enet_8021vlan_header_t *)(packBuffer->data))->type;
    }
    if(HTONS(type) != kEnetProtocoll2ptpv2)
    {
        return kStatus_ENET_Layer2TypeError;
    }

    /* Check if the queue is full*/
    if (ptpQuePtr->l2bufferPtr[ptpQuePtr->writeIdx].length != 0 )
    {
        return kStatus_ENET_Layer2BufferFull;
    }

    frame = packBuffer;
    do
    {
        /* Store the packet*/
        memcpy((void *)(ptpQuePtr->l2bufferPtr[ptpQuePtr->writeIdx].packet + length), (void *)(frame->data), length);
        length += frame->length;
        frame = frame->next;
    }while(frame != NULL);
    ptpQuePtr->l2bufferPtr[ptpQuePtr->writeIdx].length = length;

    /* Increase the index to the next one*/
    ptpQuePtr->writeIdx = (ptpQuePtr->writeIdx + 1) % enetIfPtr->privatePtp.layer2Queue.l2bufferNum;

    return kStatus_ENET_Success;
}

/*FUNCTION****************************************************************
 *
 * Function Name: enet_ptp_send_l2packet
 * Return Value: The execution status.
 * Description: Send the ptp layer2 Ethernet packet to the net.
 * This interface is used to send the ptp layer2 Ethernet packet and 
 * this interface is called by 1588 stack. 
 *END*********************************************************************/
uint32_t ENET_DRV_Send_l2packet(enet_dev_if_t * enetIfPtr, enet_mac_ptp_l2_packet_t *paramPtr)
{
    uint32_t datalen, dataoffset = 0;
    uint8_t headlen;
    uint16_t vlanTag, bdNumUsed = 0;
    volatile enet_bd_struct_t *bdTemp;
    uint8_t *packet;
    /* Check input parameters*/
    if ((!enetIfPtr) || (!paramPtr))
    {
        return kStatus_ENET_InvalidInput;
    }

    bdTemp = enetIfPtr->bdContext.txBdCurPtr;
    packet = ENET_HAL_GetBuffDescripData(bdTemp);
    /* Add Ethernet MAC address*/
    memcpy(packet, &(paramPtr->hwAddr[0]), kEnetMacAddrLen);
    memcpy(packet + kEnetMacAddrLen, enetIfPtr->macAddr, kEnetMacAddrLen);
     
    if(!enetIfPtr->isVlanTagEnabled)
    {
         headlen = kEnetEthernetHeadLen;
        ((enet_ethernet_header_t *)packet)->type = HTONS(kEnetProtocoll2ptpv2);
    }
    else
    {
         headlen = kEnetEthernetVlanHeadLen;
         vlanTag = (uint16_t)((uint16_t)paramPtr->vlanPrior << 13) | paramPtr->vlanId;        
        ((enet_8021vlan_header_t *)packet)->tpidtag = HTONS(kEnetProtocol8021QVlan);
        ((enet_8021vlan_header_t *)packet)->othertag = HTONS(vlanTag);
        ((enet_8021vlan_header_t *)packet)->type = HTONS(kEnetProtocoll2ptpv2);
    }

    datalen = paramPtr->length + headlen;
    /* Check transmit packets*/
    if (datalen > enetIfPtr->maxFrameSize)
    {
#if ENET_ENABLE_DETAIL_STATS
       enetIfPtr->stats.statsTxLarge++;
       enetIfPtr->stats.statsTxDiscard++;
#endif
       return kStatus_ENET_Layer2OverLarge;
    }
    /* Send a whole frame with a signal buffer*/
    if(datalen <= enetIfPtr->bdContext.txBuffSizeAlign)
    { 
        bdNumUsed = 1;
        memcpy((void *)(packet + headlen), (void *)(paramPtr->ptpMsg), paramPtr->length);
        /* Send packet to the device*/
        return ENET_DRV_SendData(enetIfPtr, datalen, bdNumUsed);
    }
    /* Send a whole frame with multiple buffer descriptors*/
    while((datalen - bdNumUsed * enetIfPtr->bdContext.txBuffSizeAlign) > enetIfPtr->bdContext.txBuffSizeAlign)
    {
        if(bdNumUsed == 0)
        {
            memcpy((void *)(packet + headlen), (void *)(paramPtr->ptpMsg), enetIfPtr->bdContext.txBuffSizeAlign - headlen);
            dataoffset += enetIfPtr->bdContext.txBuffSizeAlign - headlen;
        }
        else
        {
            memcpy((void *)packet, (void *)(paramPtr->ptpMsg + dataoffset), enetIfPtr->bdContext.txBuffSizeAlign);  
            dataoffset += enetIfPtr->bdContext.txBuffSizeAlign;
        }
        /* Incremenet the buffer descriptor*/
        bdTemp = ENET_DRV_IncrTxBuffDescripIndex(enetIfPtr, bdTemp);
        packet = ENET_HAL_GetBuffDescripData(bdTemp);
        bdNumUsed ++;
    }
     memcpy((void *)packet, (void *)(paramPtr->ptpMsg + dataoffset), 
         datalen - bdNumUsed* enetIfPtr->bdContext.txBuffSizeAlign);     
     bdNumUsed ++;

    /* Send packet to the device*/
    return ENET_DRV_SendData(enetIfPtr, datalen, bdNumUsed);
}

/*FUNCTION****************************************************************
 *
 * Function Name: ENET_DRV_Receive_l2packet
 * Return Value: The execution status.
 * Description: Receive the ptp layer2 Ethernet packet to the net.
 * This interface is used to receive the ptp layer2 Ethernet packet and 
 * this interface is called by 1588 stack. 
 *END*********************************************************************/
uint32_t ENET_DRV_Receive_l2packet(enet_dev_if_t * enetIfPtr, enet_mac_ptp_l2_packet_t *paramPtr)
{
    enet_private_ptp_buffer_t *ptpBuffer;
    uint32_t result = kStatus_ENET_Success;
    uint16_t len;
   
