jamesmunns/kinetis-rs/platform/drivers/enet/src/fsl_enet_driver.c
    switch (commandId)
    {
        case kEnetPtpGetRxTimestamp:
            /* Get receive timestamp*/
            result = ENET_DRV_Search1588TsBuff(&buffer->rxTimeStamp,
                (enet_mac_ptp_ts_data_t *)inOutPtr); 
            break;
        case kEnetPtpGetTxTimestamp:
            /* Get transmit timestamp*/
            result = ENET_DRV_Search1588TsBuff(&buffer->txTimeStamp,
                (enet_mac_ptp_ts_data_t *)inOutPtr);
            break;
        case kEnetPtpGetCurrentTime:
            /* Get current time*/
            result = ENET_DRV_Get1588timer(&ptpTimer);
            inOutPtr = (enet_mac_ptp_time_t *)&ptpTimer;
            break;
        case kEnetPtpSetCurrentTime:
            /* Set current time*/
            ptpTimer.second = ((enet_mac_ptp_time_t *)inOutPtr)->second;
            ptpTimer.nanosecond = ((enet_mac_ptp_time_t *)inOutPtr)->nanosecond;
            result = ENET_DRV_Set1588timer(&ptpTimer);
            break;
        case kEnetPtpFlushTimestamp:
            /* Reset receive and transmit buffer*/
            buffer->rxTimeStamp.end = 0;
            buffer->rxTimeStamp.front = 0;
            buffer->txTimeStamp.end = 0;
            buffer->txTimeStamp.front = 0;
            break;
        case kEnetPtpCorrectTime:
            /* Adjust time*/
            result = ENET_DRV_Adjust1588timer(enetIfPtr->deviceNumber, 
                ((enet_ptp_drift_t *)inOutPtr)->drift);
            break;
        case kEnetPtpSendEthernetPtpV2:
            /* Send layer2 packet*/
            result = ENET_DRV_Send_l2packet(enetIfPtr, inOutPtr);
            break;
        case kEnetPtpReceiveEthernetPtpV2:
            /* Receive layer2 packet*/
            result = ENET_DRV_Receive_l2packet(enetIfPtr, inOutPtr);
            break;
        default:
            result = kStatus_ENET_UnknownCommand;
            break;
    }
    return result;
}

/*FUNCTION****************************************************************
 *
 * Function Name: ENET_DRV_TsIRQHandler
 * Description: ENET timer ISR.
 * This interface is the ptp timer interrupt handler.
 *END*********************************************************************/
void ENET_DRV_TsIRQHandler(uint32_t instance)
{
    uint32_t baseAddr;
    enet_dev_if_t *enetIfPtr;

    enetIfPtr = enetIfHandle[instance];
    /*Check input parameter*/
    if (!enetIfPtr)
    {
        return;
    }
    baseAddr = g_enetBaseAddr[instance];
    /*Get interrupt status*/
    if (ENET_HAL_GetIntStatusFlag(baseAddr, kEnetTsTimerInterrupt))
    {
#if FSL_FEATURE_ENET_PTP_TIMER_CHANNEL_INTERRUPT_ERRATA_2579
        ENET_HAL_Set1588TimerChnCmpVal(baseAddr, ENET_TIMER_CHANNEL_NUM,(kEnetPtpAtperVaule - kEnetPtpAtperVaule/g_ptpClkFrq))
        ENET_HAL_Clear1588TimerChnFlag(baseAddr, ENET_TIMER_CHANNEL_NUM);
#else
        /*Clear interrupt events*/
        ENET_HAL_ClearIntStatusFlag(baseAddr, kEnetTsTimerInterrupt);
#endif
        /* Increase timer second counter*/
        g_ptpMasterTime.second++;
    }
}

#endif

/*FUNCTION****************************************************************
 *
 * Function Name: ENET_DRV_Init
 * Return Value: The execution status.
 * Description:Initialize the ENET device with the basic configuration
 * When ENET is used, this function need to be called by the NET initialize 
 * interface.
 *END*********************************************************************/
uint32_t ENET_DRV_Init(enet_dev_if_t * enetIfPtr, const enet_mac_config_t *macCfgPtr, enet_buff_config_t *buffCfgPtr)
{   
    uint32_t  frequency, result, baseAddr; 

    /* Check the input parameters*/
    if ((!enetIfPtr) || (!macCfgPtr) || (!buffCfgPtr))
    {
        return kStatus_ENET_InvalidInput;
    }
#if !ENET_RECEIVE_ALL_INTERRUPT
    /* POLL mode needs the extended buffer for data buffer update*/
    if((!buffCfgPtr->extRxBuffQue) || (!buffCfgPtr->extRxBuffNum))
    {
        return kStatus_ENET_InvalidInput;
    }
#endif
    baseAddr = g_enetBaseAddr[enetIfPtr->deviceNumber];

    /* Store the global ENET structure for ISR input parameter*/
    enetIfHandle[enetIfPtr->deviceNumber] = enetIfPtr;

    /* Turn on ENET module clock gate */
    CLOCK_SYS_EnableEnetClock( 0U);
    CLOCK_SYS_GetFreq(kSystemClock, &frequency);

    /* Init ENET MAC to reset status*/
    ENET_HAL_Init(baseAddr);

    /* Configure MAC controller*/
    ENET_HAL_SetMac(baseAddr, macCfgPtr, frequency);

    /* Initialize FIFO*/
    ENET_HAL_SetFifo(baseAddr, macCfgPtr);

    /* Initialize receive and transmit buffer descriptors*/    
    ENET_HAL_SetRxBuffDescriptors(baseAddr, buffCfgPtr->rxBdPtrAlign, buffCfgPtr->rxBufferAlign,
                    buffCfgPtr->rxBdNumber, buffCfgPtr->rxBuffSizeAlign);
    ENET_HAL_SetTxBuffDescriptors(baseAddr, buffCfgPtr->txBdPtrAlign, buffCfgPtr->txBufferAlign,
              buffCfgPtr->txBdNumber, buffCfgPtr->txBuffSizeAlign);
#if FSL_FEATURE_ENET_SUPPORT_PTP
    result = ENET_DRV_1588Init(enetIfPtr, buffCfgPtr->ptpTsRxDataPtr, buffCfgPtr->ptpTsRxBuffNum,
            buffCfgPtr->ptpTsTxDataPtr, buffCfgPtr->ptpTsTxBuffNum, macCfgPtr->isSlaveMode);
    if(result != kStatus_ENET_Success)
    {
        return result;
    }
#endif
    /* Enable Ethernet rx and tx interrupt*/
    ENET_HAL_SetIntMode(baseAddr, kEnetTxByteInterrupt, true);
    ENET_HAL_SetIntMode(baseAddr, kEnetRxFrameInterrupt, true);

    INT_SYS_EnableIRQ(g_enetRxIrqId[enetIfPtr->deviceNumber]);
    INT_SYS_EnableIRQ(g_enetTxIrqId[enetIfPtr->deviceNumber]);
    
    /* Enable Ethernet module after all configuration except the bd active*/
    ENET_HAL_Enable(baseAddr);

    /* Active Receive buffer descriptor must be done after module enable*/
    ENET_HAL_SetRxBuffDescripActive(baseAddr);

    /* Store data in bdContext*/
    /* Set crc enable when tx crc forward disable and tx buffer descriptor crc enabled*/	
    if((!(macCfgPtr->macCtlConfigure & kEnetTxCrcFwdEnable))&&(macCfgPtr->macCtlConfigure & kEnetTxCrcBdEnable))
    {
        enetIfPtr->bdContext.isTxCrcEnable = true;
    }
    else
    {
        enetIfPtr->bdContext.isTxCrcEnable = false;
    }
    enetIfPtr->bdContext.isRxCrcFwdEnable = (macCfgPtr->macCtlConfigure & kEnetRxCrcFwdEnable) ? 1U : 0U;
    memcpy(enetIfPtr->macAddr, macCfgPtr->macAddr, kEnetMacAddrLen);
    enetIfPtr->isVlanTagEnabled = (macCfgPtr->macCtlConfigure & kEnetVlanTagEnabled) ? 1U : 0U;
    enetIfPtr->bdContext.rxBdBasePtr = buffCfgPtr->rxBdPtrAlign;
    enetIfPtr->bdContext.rxBdCurPtr = buffCfgPtr->rxBdPtrAlign;
    enetIfPtr->bdContext.rxBdDirtyPtr = buffCfgPtr->rxBdPtrAlign;
    enetIfPtr->bdContext.txBdBasePtr = buffCfgPtr->txBdPtrAlign;
    enetIfPtr->bdContext.txBdCurPtr = buffCfgPtr->txBdPtrAlign;
    enetIfPtr->bdContext.txBdDirtyPtr = buffCfgPtr->txBdPtrAlign;
    enetIfPtr->bdContext.rxBuffSizeAlign = buffCfgPtr->rxBuffSizeAlign;
    enetIfPtr->bdContext.txBuffSizeAlign = buffCfgPtr->txBuffSizeAlign;
    enetIfPtr->maxFrameSize = macCfgPtr->rxMaxFrameLen;
    /* Extend buffer for data buffer update*/
    if(buffCfgPtr->extRxBuffQue != NULL)
    {
        uint16_t counter = 0;
        enetIfPtr->bdContext.extRxBuffQue = NULL;
        for(counter = 0; counter < buffCfgPtr->extRxBuffNum; counter++)
        {
            enet_mac_enqueue_buffer((void **)&enetIfPtr->bdContext.extRxBuffQue, 
                (buffCfgPtr->extRxBuffQue + counter * buffCfgPtr->rxBuffSizeAlign));
        }   
        enetIfPtr->bdContext.extRxBuffNum = buffCfgPtr->extRxBuffNum;
    } 

    return kStatus_ENET_Success;
}

/*FUNCTION****************************************************************
 *
 * Function Name: ENET_DRV_Deinit
 * Return Value: The execution status.
 * Description: Close ENET device.
 * This function is used to shut down ENET device.
 *END*********************************************************************/
uint32_t ENET_DRV_Deinit(enet_dev_if_t * enetIfPtr)
{
    uint32_t baseAddr;

    /*Check input parameter*/
    if (!enetIfPtr)
    {
        return kStatus_ENET_InvalidInput;
    }
    baseAddr = g_enetBaseAddr[enetIfPtr->deviceNumber];
    /* Reset ENET module and disable ENET module*/
    ENET_HAL_Init(baseAddr);
#if FSL_FEATURE_ENET_SUPPORT_PTP
     ENET_DRV_1588Deinit(enetIfPtr);
#endif
    /* Disable irq*/
    INT_SYS_DisableIRQ(g_enetTxIrqId[enetIfPtr->deviceNumber]);
    INT_SYS_DisableIRQ(g_enetRxIrqId[enetIfPtr->deviceNumber]);
    INT_SYS_DisableIRQ(g_enetTsIrqId[enetIfPtr->deviceNumber]);
    INT_SYS_DisableIRQ(g_enetErrIrqId[enetIfPtr->deviceNumber]);

