jamesmunns/kinetis-rs/platform/drivers/enet/src/fsl_enet_driver.c
    /* Clear the global ENET structure*/
    enetIfHandle[enetIfPtr->deviceNumber] = NULL;
    return kStatus_ENET_Success;
}

/*FUNCTION****************************************************************
 *
 * Function Name: ENET_DRV_UpdateRxBuffDescrip
 * Return Value: The execution status.
 * Description: ENET receive buffer descriptor update.
 * This interface provides the receive buffer descriptor update and increase 
 * the current buffer descriptor pointer to the next one.
 *END*********************************************************************/
uint32_t ENET_DRV_UpdateRxBuffDescrip(enet_dev_if_t * enetIfPtr, bool isBuffUpdate)
{
    uint32_t baseAddr;
    uint8_t *bufferTemp = NULL;
    baseAddr = g_enetBaseAddr[enetIfPtr->deviceNumber];

    while((enetIfPtr->bdContext.rxBdDirtyPtr != enetIfPtr->bdContext.rxBdCurPtr) ||
        (enetIfPtr->bdContext.isRxBdFull))
    {
        if(isBuffUpdate)
        {
            /* get the data buffer for update*/
            bufferTemp = enet_mac_dequeue_buffer((void **)&enetIfPtr->bdContext.extRxBuffQue); 
            if(!bufferTemp)
            {
                return kStatus_ENET_NoRxBufferLeft;
            }       
        }

        ENET_HAL_UpdateRxBuffDescriptor(enetIfPtr->bdContext.rxBdDirtyPtr, bufferTemp, isBuffUpdate);

        /* Increase the buffer descritpr to the next one*/
        enetIfPtr->bdContext.rxBdDirtyPtr = 
            ENET_DRV_IncrRxBuffDescripIndex(enetIfPtr, enetIfPtr->bdContext.rxBdDirtyPtr);
        enetIfPtr->bdContext.isRxBdFull = false;

        /* Active the receive buffer descriptor*/
        ENET_HAL_SetRxBuffDescripActive(baseAddr);
    }

    return kStatus_ENET_Success;
}
/*FUNCTION****************************************************************
 *
 * Function Name: ENET_DRV_CleanupTxBuffDescrip
 * Return Value: The execution status.
 * Description: First, store transmit frame error statistic and ptp timestamp 
 * of transmitted packets. Second, clean up the used transmit buffer descriptors.
 * If the ptp 1588 feature is open, this interface will do capture 1588 timestamp. 
 * It is called by transmit interrupt handler.
 *END*********************************************************************/
uint32_t ENET_DRV_CleanupTxBuffDescrip(enet_dev_if_t * enetIfPtr)
{
    uint16_t dataCtl;
    volatile enet_bd_struct_t *curBd;

    while ((enetIfPtr->bdContext.txBdDirtyPtr != enetIfPtr->bdContext.txBdCurPtr)
           || (enetIfPtr->bdContext.isTxBdFull))
    {
        curBd = enetIfPtr->bdContext.txBdDirtyPtr;
        /* Get the control status data, If the bd has not been processed break out*/
        dataCtl = ENET_HAL_GetTxBuffDescripControl(curBd);
        if (dataCtl & kEnetTxBdReady)
        {
            break;
        }
#if FSL_FEATURE_ENET_SUPPORT_PTP
        if(enetIfPtr->privatePtp.firstflag)
        {
            enetIfPtr->privatePtp.firstBdPtr = curBd;
            enetIfPtr->privatePtp.firstflag = false;
        }
#endif
        /* If the transmit buffer descriptor is ready, store packet statistic*/
        if ( dataCtl & kEnetTxBdLast)
        {
#if ENET_ENABLE_DETAIL_STATS
             ENET_DRV_TxErrorStats(enetIfPtr,curBd);
#endif
#if FSL_FEATURE_ENET_SUPPORT_PTP
            /* Do ptp timestamp store*/
            if (ENET_HAL_GetTxBuffDescripTsFlag(curBd))
            {
                ENET_DRV_GetTxTs(&enetIfPtr->privatePtp, enetIfPtr->privatePtp.firstBdPtr, curBd);
                enetIfPtr->privatePtp.firstflag = true;
            }
#endif
        }

        /* Clear the buffer descriptor buffer address*/
        ENET_HAL_ClearTxBuffDescriptor(curBd);

        /* Update the buffer address*/
        enetIfPtr->bdContext.txBdDirtyPtr = 
           ENET_DRV_IncrTxBuffDescripIndex(enetIfPtr, enetIfPtr->bdContext.txBdDirtyPtr);
    }
    
    return kStatus_ENET_Success;
}

/*FUNCTION****************************************************************
 *
 * Function Name: ENET_DRV_IncrRxBuffDescripIndex
 * Return Value: The execution status.
 * Description: Increases the receive buffer descriptor to the next one.
 *END*********************************************************************/
volatile enet_bd_struct_t * ENET_DRV_IncrRxBuffDescripIndex(enet_dev_if_t * enetIfPtr, volatile enet_bd_struct_t *curBd)
{
    /* Incremenet the buffer descriptor*/
    if (ENET_HAL_GetRxBuffDescripControl(curBd) & kEnetRxBdWrap)
    {
        curBd = enetIfPtr->bdContext.rxBdBasePtr;
    }
    else
    {
        curBd ++;
    }
    return curBd;
}

/*FUNCTION****************************************************************
 *
 * Function Name: ENET_DRV_IncrTxBuffDescripIndex
 * Return Value: The execution status.
 * Description: Increases the transmit buffer descriptor to the next one.
 *END*********************************************************************/
volatile enet_bd_struct_t * ENET_DRV_IncrTxBuffDescripIndex(enet_dev_if_t * enetIfPtr, volatile enet_bd_struct_t *curBd)
{
    /* Incremenet the buffer descriptor*/
    if (ENET_HAL_GetTxBuffDescripControl(curBd) & kEnetTxBdWrap)
    {
        curBd = enetIfPtr->bdContext.txBdBasePtr;
    }
    else
    {
        curBd ++;
    }
    return curBd;
}
/*FUNCTION****************************************************************
 *
 * Function Name: ENET_DRV_TxErrorStats
 * Return Value: .
 * Description: ENET frame receive stats process.
 * This interface is used to process packet error statistic 
 * in the last buffer descriptor of each frame.
 *END*********************************************************************/
void ENET_DRV_TxErrorStats(enet_dev_if_t * enetIfPtr, volatile enet_bd_struct_t *curBd)
{
#if ENET_ENABLE_DETAIL_STATS
    uint16_t dataCtl;

    /* Get extended control regions of the transmit buffer descriptor*/
    dataCtl = ENET_HAL_GetTxBuffDescripExtControl(curBd);
    if (dataCtl & kEnetTxBdTxErr)
    {
        /* Transmit error*/
        enetIfPtr->stats.statsTxError++;

