jamesmunns/kinetis-rs/platform/drivers/enet/src/fsl_enet_driver.c
        if (dataCtl & kEnetTxBdExcessCollisionErr)
        {
            /* Transmit excess collision*/
            enetIfPtr->stats.statsTxExcessCollision++;
        }
        if (dataCtl & kEnetTxBdLatecollisionErr)
        {   
            /* Transmit late collision*/
            enetIfPtr->stats.statsTxLateCollision++;
        }
        if (dataCtl & kEnetTxBdTxUnderFlowErr)
        {
            /* Transmit underflow*/
            enetIfPtr->stats.statsTxUnderFlow++;
        }
        if (dataCtl & kEnetTxBdOverFlowErr)
        {
            /* Transmit overflow*/
            enetIfPtr->stats.statsTxOverFlow++;
        }
    }
#endif	 
    enetIfPtr->stats.statsTxTotal++;
}
/*FUNCTION****************************************************************
 *
 * Function Name: ENET_DRV_RxErrorStats
 * Return Value: true if the frame is error else false.
 * Description: ENET frame receive stats process.
 * This interface is used to process packet statistic in the last buffer
 * descriptor of each frame.
 *END*********************************************************************/
bool ENET_DRV_RxErrorStats(enet_dev_if_t * enetIfPtr, uint32_t data)
{
    uint32_t status;

    /* The last bd in the frame check the stauts of the received frame*/
    status = kEnetRxBdLengthViolation | kEnetRxBdOverRun | kEnetRxBdNoOctet | kEnetRxBdCrc | kEnetRxBdCollision;
    if (data & status)
    {
#if ENET_ENABLE_DETAIL_STATS         
        /* Discard error packets*/
        enetIfPtr->stats.statsRxError++;
        enetIfPtr->stats.statsRxDiscard++;

        /* Receive error*/
        if ((data & kEnetRxBdOverRun) != 0)
        {
            /* Receive over run*/
            enetIfPtr->stats.statsRxOverRun++;
        }
        else if ((data & kEnetRxBdLengthViolation) != 0)
        {
            /* Receive length greater than max frame*/
            enetIfPtr->stats.statsRxLengthGreater++;
        }
        else if ( (data & kEnetRxBdNoOctet) != 0)
        {
            /* Receive non-octet aligned frame*/
            enetIfPtr->stats.statsRxAlign++;
        }
        else if ((data & kEnetRxBdCrc) != 0)
        {
            /* Receive crc error*/
            enetIfPtr->stats.statsRxFcs++;
        }
        else if ((data & kEnetRxBdCollision) != 0)
        { 
            /* late collision frame discard*/
            enetIfPtr->stats.statsRxCollision++;
        }
#endif
        return true;
    }
    else
    {
        /* Add the right packets*/            
        enetIfPtr->stats.statsRxTotal++;
        return false;
    }
}

#if ENET_RECEIVE_ALL_INTERRUPT
/*FUNCTION****************************************************************
 *
 * Function Name: ENET_DRV_ReceiveData
 * Return Value: The execution status.
 * Description: ENET frame receive function.
 * This interface receive the frame from ENET deviece and returns the address 
 * of the received data. This is used to do receive data in receive interrupt
 * handler. This is the pure interrupt mode
 *END*********************************************************************/
uint32_t ENET_DRV_ReceiveData(enet_dev_if_t * enetIfPtr)
{
    volatile enet_bd_struct_t *curBd;
    uint16_t bdNumTotal = 0, lenTotal = 0;
    uint32_t controlStatus;
    enet_mac_packet_buffer_t packetBuffer[kEnetMaxFrameBdNumbers] = {{0}};
    /* Check input parameters*/
    if ((!enetIfPtr) || (!enetIfPtr->bdContext.rxBdCurPtr))
    {
        return kStatus_ENET_InvalidInput;
    }
   
    /* Check the current buffer descriptor address*/
    curBd = enetIfPtr->bdContext.rxBdCurPtr;
    /* Return if the current buffer descriptor is empty*/	
    controlStatus = ENET_HAL_GetRxBuffDescripControl(curBd);
    while((controlStatus & kEnetRxBdEmpty) == 0)
    {
        /* Check if receive buffer is full*/
        if(enetIfPtr->bdContext.isRxBdFull)
        {
#if ENET_ENABLE_DETAIL_STATS 
            enetIfPtr->stats.statsRxDiscard++;
#endif
            ENET_DRV_UpdateRxBuffDescrip(enetIfPtr, false);
            return kStatus_ENET_RxBdFull;
        }

        /* Increase current buffer descriptor to the next one*/
        enetIfPtr->bdContext.rxBdCurPtr = 
            ENET_DRV_IncrRxBuffDescripIndex(enetIfPtr, enetIfPtr->bdContext.rxBdCurPtr);
        /* Check if the buffer is full*/
        if (enetIfPtr->bdContext.rxBdCurPtr == enetIfPtr->bdContext.rxBdDirtyPtr)
        {
            enetIfPtr->bdContext.isRxBdFull = true;
        }

         /* Discard packets with truncate error*/
        if ((controlStatus & kEnetRxBdTrunc) != 0 )
        {
#if ENET_ENABLE_DETAIL_STATS 
            enetIfPtr->stats.statsRxTruncate++;
            enetIfPtr->stats.statsRxDiscard++;
#endif
            ENET_DRV_UpdateRxBuffDescrip(enetIfPtr, false);
            return kStatus_ENET_RxbdTrunc;
        }
        
       if ((controlStatus & kEnetRxBdLast) != 0)
       {
           /* The last bd in the frame check the stauts of the received frame*/
           if (ENET_DRV_RxErrorStats(enetIfPtr, controlStatus))
           {
               ENET_DRV_UpdateRxBuffDescrip(enetIfPtr, false);
               return kStatus_ENET_RxbdError;
           }
           else
           {
                packetBuffer[bdNumTotal].data = ENET_HAL_GetBuffDescripData(curBd);
                packetBuffer[bdNumTotal].length = ENET_HAL_GetBuffDescripLen(curBd) - lenTotal;
                /* Crc length check */
                if(enetIfPtr->bdContext.isRxCrcFwdEnable)
                {
                    packetBuffer[bdNumTotal].length -= kEnetFrameFcsLen;
                }
                packetBuffer[bdNumTotal].next = NULL;
#if FSL_FEATURE_ENET_SUPPORT_PTP
                ENET_DRV_GetRxTs(&enetIfPtr->privatePtp, 
                    packetBuffer[0].data, curBd);
#endif
                enetIfPtr->enetNetifcall(enetIfPtr, &packetBuffer[0]);
               /* Update receive buffer descriptor*/
               ENET_DRV_UpdateRxBuffDescrip(enetIfPtr, false);
               bdNumTotal = 0;
           }
        }
        else
        {
            packetBuffer[bdNumTotal].data = ENET_HAL_GetBuffDescripData(curBd);
            packetBuffer[bdNumTotal].length = enetIfPtr->bdContext.rxBuffSizeAlign;
            lenTotal += packetBuffer[bdNumTotal].length;
            packetBuffer[bdNumTotal].next = &packetBuffer[bdNumTotal + 1];
            bdNumTotal ++;
            /* Check a frame with total bd numbers */
            if (bdNumTotal == kEnetMaxFrameBdNumbers)
            {
#if ENET_ENABLE_DETAIL_STATS 
                enetIfPtr->stats.statsRxDiscard++;
#endif
                ENET_DRV_UpdateRxBuffDescrip(enetIfPtr, false);
                return kStatus_ENET_SmallRxBuffSize;
            }
        }

        /* Check the current buffer descriptor address*/
        curBd = enetIfPtr->bdContext.rxBdCurPtr;
        controlStatus = ENET_HAL_GetRxBuffDescripControl(curBd);
    }

    return kStatus_ENET_Success;
}

#else
/*FUNCTION****************************************************************
 *
 * Function Name: ENET_DRV_ReceiveData
 * Return Value: The execution status.
 * Description: ENET frame receive function.
 * This interface receive the frame from ENET device and returns the address 
 * of the received data. This is used to do receive data on polling +
 * interrupt mode.
 * we recommend to use the sync signal in receive interrupt handler to 
 * wakeup the blocked polling or for sync signal flag check when receive 
 * data on polling mode.
 * To avoid the receive buffer descriptor overflow due to the latency 
 * of the stack process task, extended data buffers in enetIfPtr->bdContext.extRxBuffQue
 * are used to update the receive buffer descriptor. please make sure
 * the data buffers are immediately enqueued back to the enetIfPtr->bdContext.extRxBuffQue  
 * after the data is copied to upper layer buffer. enet_mac_enqueue_buffer should be
 * called to do the data buffer enqueue process in your receive adaptor application. 
 *
 *END*********************************************************************/
uint32_t ENET_DRV_ReceiveData(enet_dev_if_t * enetIfPtr, enet_mac_packet_buffer_t *packBuffer)
{
    volatile enet_bd_struct_t *curBd;
    bool isLastFrame = true;
    uint16_t totalLen = 0;
    uint32_t controlStatus;
    enet_mac_packet_buffer_t *TempBuff = NULL;
    /* Check input parameters*/
    if ((!enetIfPtr) || (!packBuffer) || (!enetIfPtr->bdContext.rxBdCurPtr))
    {
        return kStatus_ENET_InvalidInput;
    }

