jamesmunns/kinetis-rs/platform/drivers/enet/src/fsl_enet_driver.c
    /* Check if the bd is full*/
    if (!enetIfPtr->bdContext.isRxBdFull)
    {
        /* Check the current buffer descriptor address*/
        curBd = enetIfPtr->bdContext.rxBdCurPtr;
        controlStatus = ENET_HAL_GetRxBuffDescripControl(curBd);
        if ((controlStatus & kEnetRxBdEmpty) != 0)
        {
            return kStatus_ENET_RxbdEmpty;
        }
    
        /* Increase current buffer descriptor to the next one*/
        enetIfPtr->bdContext.rxBdCurPtr = 
            ENET_DRV_IncrRxBuffDescripIndex(enetIfPtr, enetIfPtr->bdContext.rxBdCurPtr);
        if (enetIfPtr->bdContext.rxBdCurPtr == enetIfPtr->bdContext.rxBdDirtyPtr)
        {
            enetIfPtr->bdContext.isRxBdFull = true;
        }

        /* Discard packets with truncate error*/
        if ((controlStatus & kEnetRxBdTrunc) != 0 )
        {
#if ENET_ENABLE_DETAIL_STATS 
            enetIfPtr->stats.statsRxTruncate++;
            enetIfPtr->stats.statsRxDiscard++;
#endif
            ENET_DRV_UpdateRxBuffDescrip(enetIfPtr, false);
            return kStatus_ENET_RxbdTrunc;
        }

        if ((controlStatus & kEnetRxBdLast) != 0)
        {
            /*This is valid frame */
            isLastFrame = true;

            /* The last bd in the frame check the status of the received frame*/
            if (!ENET_DRV_RxErrorStats(enetIfPtr, controlStatus))
            {
                packBuffer->data = ENET_HAL_GetBuffDescripData(curBd);
                packBuffer->length = ENET_HAL_GetBuffDescripLen(curBd);
                /* Crc length check */
                if(enetIfPtr->bdContext.isRxCrcFwdEnable)
                {
                    packBuffer->length -= kEnetFrameFcsLen;
                }
#if FSL_FEATURE_ENET_SUPPORT_PTP
                ENET_DRV_GetRxTs(&enetIfPtr->privatePtp, packBuffer->data, curBd);
#endif
                /* Update receive buffer descriptor*/
                return ENET_DRV_UpdateRxBuffDescrip(enetIfPtr, true);
            }
            else
            {
                ENET_DRV_UpdateRxBuffDescrip(enetIfPtr, false);
                return kStatus_ENET_RxbdError;
            }
        }
        else
        {
            /* Store the fragments of a frame on several buffer descriptors*/
            isLastFrame = false;
            packBuffer->data = ENET_HAL_GetBuffDescripData(curBd);
            packBuffer->length = enetIfPtr->bdContext.rxBuffSizeAlign;
            totalLen = packBuffer->length;
            if(packBuffer->next)
            {
                TempBuff = packBuffer->next;
            }
            else
            {
#if ENET_ENABLE_DETAIL_STATS 
                enetIfPtr->stats.statsRxMissed++;
#endif
                return kStatus_ENET_NoEnoughRxBuffers;
            }
        }
    }
    else
    {
#if ENET_ENABLE_DETAIL_STATS 
         enetIfPtr->stats.statsRxMissed++;
#endif
         ENET_DRV_UpdateRxBuffDescrip(enetIfPtr, false);
         return kStatus_ENET_RxBdFull;
    }

    /*process the frame stored on several bds*/
    while (!isLastFrame)
    {
        if (!enetIfPtr->bdContext.isRxBdFull)
        {
            /* Get the current buffer descriptor address*/
            curBd = enetIfPtr->bdContext.rxBdCurPtr;
            controlStatus = ENET_HAL_GetRxBuffDescripControl(curBd);
            if ((controlStatus & kEnetRxBdEmpty) != 0)
            {
                return kStatus_ENET_RxbdEmpty;
            }
    
            /* Increase current buffer descriptor to the next one*/
            enetIfPtr->bdContext.rxBdCurPtr = 
                ENET_DRV_IncrRxBuffDescripIndex(enetIfPtr, enetIfPtr->bdContext.rxBdCurPtr);
            if (enetIfPtr->bdContext.rxBdCurPtr == enetIfPtr->bdContext.rxBdDirtyPtr)
            {
                enetIfPtr->bdContext.isRxBdFull = true;
            }

            /* Discard packets with truncate error*/
            if ((controlStatus & kEnetRxBdTrunc) != 0)
            {
#if ENET_ENABLE_DETAIL_STATS 
                enetIfPtr->stats.statsRxTruncate++;
                enetIfPtr->stats.statsRxDiscard++;
#endif
                ENET_DRV_UpdateRxBuffDescrip(enetIfPtr, false);
                return kStatus_ENET_RxbdTrunc;
            }
    
            if ((controlStatus & kEnetRxBdLast) != 0)
            {
                /*This is the last bd in a frame*/     
                isLastFrame = true;
    
                /* The last bd in the frame check the status of the received frame*/
                if (ENET_DRV_RxErrorStats(enetIfPtr, controlStatus))
                {
                    ENET_DRV_UpdateRxBuffDescrip(enetIfPtr, false);
                    return kStatus_ENET_RxbdError;
                }
                else
                {
                    TempBuff->data = ENET_HAL_GetBuffDescripData(curBd);
                    TempBuff->length = ENET_HAL_GetBuffDescripLen(curBd) - totalLen;
                    /* Crc length check */
                    if(enetIfPtr->bdContext.isRxCrcFwdEnable)
                    {
                        TempBuff->length -= kEnetFrameFcsLen;
                    }                   
                    /* Delivery the last part data to the packet*/
#if FSL_FEATURE_ENET_SUPPORT_PTP
                    ENET_DRV_GetRxTs(&enetIfPtr->privatePtp, packBuffer->data, curBd);
#endif
                    /* Update receive buffer descriptor*/         
                    return ENET_DRV_UpdateRxBuffDescrip(enetIfPtr, true);
                }
            }
            else
            {
                isLastFrame = false;
                TempBuff->data = ENET_HAL_GetBuffDescripData(curBd);
                TempBuff->length = enetIfPtr->bdContext.rxBuffSizeAlign;
                totalLen += TempBuff->length;             
                if(TempBuff->next)
                {
                    TempBuff = TempBuff->next;
                }
                else
                {
#if ENET_ENABLE_DETAIL_STATS 
                    enetIfPtr->stats.statsRxMissed++;
#endif
                    return kStatus_ENET_NoEnoughRxBuffers;
                }
            }  
        }
        else
        {
#if ENET_ENABLE_DETAIL_STATS 
            enetIfPtr->stats.statsRxMissed++;
#endif
            ENET_DRV_UpdateRxBuffDescrip(enetIfPtr, false);
            return kStatus_ENET_RxBdFull;
        }
    }

    return kStatus_ENET_Success;
}
#endif
/*FUNCTION****************************************************************
 *
 * Function Name: ENET_DRV_SendData
 * Return Value: The execution status.
 * Description: ENET frame send function.
 * This interface send the frame to ENET device. If the transmit buffer size
 * is less than the maximum frame size 1518/1522, please make sure the buffer
 * size larger than 256. 
 *END*********************************************************************/
uint32_t ENET_DRV_SendData(enet_dev_if_t * enetIfPtr, uint32_t dataLen, uint32_t bdNumUsed)
{
    volatile enet_bd_struct_t *curBd;
    bool isPtpMsg = false;
    uint16_t bdIdx = 0;
    uint32_t size = 0, baseAddr;
    uint8_t *packet;

