jamesmunns/kinetis-rs/platform/drivers/enet/src/fsl_enet_driver.c
    /* Check input parameters*/
    if ((!enetIfPtr ) || (!bdNumUsed))
    {
        return kStatus_ENET_InvalidInput;
    }

    if(enetIfPtr->bdContext.isTxBdFull)
    {
#if ENET_ENABLE_DETAIL_STATS
        enetIfPtr->stats.statsTxMissed ++;
#endif
        return kStatus_ENET_TxbdFull;
    }

    /* Get the current buffer descriptor address*/
    curBd = enetIfPtr->bdContext.txBdCurPtr;
#if FSL_FEATURE_ENET_SUPPORT_PTP
    /* Check ptp message only for the first part including ptp head information*/ 
    packet = ENET_HAL_GetBuffDescripData(curBd);
    ENET_DRV_Parse1588Packet(packet, NULL, &isPtpMsg, true);
#endif
    baseAddr = g_enetBaseAddr[enetIfPtr->deviceNumber];
    /* Bd number need for the data transmit*/
    if(bdNumUsed == 1)
    {  
        /* Packet the transmit frame to the buffer descriptor*/
        ENET_HAL_UpdateTxBuffDescriptor(curBd, dataLen, isPtpMsg, enetIfPtr->bdContext.isTxCrcEnable, true);

        /* Increase the buffer descriptor address*/
        enetIfPtr->bdContext.txBdCurPtr = 
            ENET_DRV_IncrTxBuffDescripIndex(enetIfPtr, enetIfPtr->bdContext.txBdCurPtr);

        /* Return if the transmit buffer ring is full*/
        if (enetIfPtr->bdContext.txBdCurPtr == enetIfPtr->bdContext.txBdDirtyPtr)
        {
            enetIfPtr->bdContext.isTxBdFull = true;
        }
        else
        {
            enetIfPtr->bdContext.isTxBdFull = false;
        }
        /* Active the receive buffer descriptor*/
        ENET_HAL_SetTxBuffDescripActive(baseAddr);   

   }
   else
   {
        for(bdIdx = 0; bdIdx < bdNumUsed; bdIdx ++)
        {

            if(enetIfPtr->bdContext.isTxBdFull)
            {
#if ENET_ENABLE_DETAIL_STATS
                enetIfPtr->stats.statsTxMissed ++;
#endif
                return kStatus_ENET_TxbdFull;
            }

            /* Get the current buffer descriptor address*/
            curBd = enetIfPtr->bdContext.txBdCurPtr;

            /* Last Buffer Descrip*/
            if(bdIdx == bdNumUsed - 1) 
            {
                /* Packet the transmit frame to the buffer descriptor*/
                ENET_HAL_UpdateTxBuffDescriptor(curBd, dataLen - size, isPtpMsg, enetIfPtr->bdContext.isTxCrcEnable, true);
            }
            else
            {
                /* Packet the transmit frame to the buffer descriptor*/
                ENET_HAL_UpdateTxBuffDescriptor(curBd, enetIfPtr->bdContext.txBuffSizeAlign, isPtpMsg, enetIfPtr->bdContext.isTxCrcEnable, false);
                size += enetIfPtr->bdContext.txBuffSizeAlign;
            }

            /* Increase the buffer address*/
            enetIfPtr->bdContext.txBdCurPtr = 
                ENET_DRV_IncrTxBuffDescripIndex(enetIfPtr, enetIfPtr->bdContext.txBdCurPtr);
  
            /* Return if the transmit buffer ring is full*/
            if (enetIfPtr->bdContext.txBdCurPtr == enetIfPtr->bdContext.txBdDirtyPtr)
            {
                 enetIfPtr->bdContext.isTxBdFull = true;
            }
            else
            {
                 enetIfPtr->bdContext.isTxBdFull = false;   
            }
            /* Active the receive buffer descriptor*/
            ENET_HAL_SetTxBuffDescripActive(baseAddr);
        }
    
   }
    return kStatus_ENET_Success;
}

/*FUNCTION****************************************************************
 *
 * Function Name: ENET_DRV_RxIRQHandler
 * Description: ENET receive isr.
 * This interface is the receive interrupt handler.
 *END*********************************************************************/
void ENET_DRV_RxIRQHandler(uint32_t instance)
{
    enet_dev_if_t *enetIfPtr;
    uint32_t baseAddr;
    enetIfPtr = enetIfHandle[instance];
#if !ENET_RECEIVE_ALL_INTERRUPT
    event_flags_t flag = 0x1;
#endif
    /*Check input parameter*/
    if (!enetIfPtr)
    {
        return;
    }
    baseAddr = g_enetBaseAddr[enetIfPtr->deviceNumber];
    /* Get interrupt status.*/
    while ((ENET_HAL_GetIntStatusFlag(baseAddr, kEnetRxFrameInterrupt)) || (ENET_HAL_GetIntStatusFlag(baseAddr, kEnetRxByteInterrupt)))
    {
        /*Clear interrupt*/
        ENET_HAL_ClearIntStatusFlag(baseAddr, kEnetRxFrameInterrupt);
        ENET_HAL_ClearIntStatusFlag(baseAddr, kEnetRxByteInterrupt);
#if !ENET_RECEIVE_ALL_INTERRUPT
        /* Release sync signal-----------------*/
        OSA_EventSet(&enetIfPtr->enetReceiveSync, flag);
#else
        /* Receive peripheral driver*/
        ENET_DRV_ReceiveData(enetIfPtr);
#endif    
    }
    
}


/*FUNCTION****************************************************************
 *
 * Function Name: ENET_DRV_TxIRQHandler
 * Description: ENET transmit isr.
 * This interface is the transmit interrupt handler.
 *END*********************************************************************/
void ENET_DRV_TxIRQHandler(uint32_t instance)
{
    enet_dev_if_t *enetIfPtr;
    uint32_t baseAddr;
    enetIfPtr = enetIfHandle[instance];

    /*Check input parameter*/
    if (!enetIfPtr)
    {
        return;
    }

    baseAddr = g_enetBaseAddr[enetIfPtr->deviceNumber];

    /* Get interrupt status.*/
    while ((ENET_HAL_GetIntStatusFlag(baseAddr, kEnetTxFrameInterrupt)) ||
        (ENET_HAL_GetIntStatusFlag(baseAddr, kEnetTxByteInterrupt)))   
    {
        /*Clear interrupt*/
        ENET_HAL_ClearIntStatusFlag(baseAddr, kEnetTxFrameInterrupt);
        ENET_HAL_ClearIntStatusFlag(baseAddr, kEnetTxByteInterrupt);
       
        /*Clean up the transmit buffers*/
        ENET_DRV_CleanupTxBuffDescrip(enetIfPtr);
    }   
}

/*FUNCTION****************************************************************
 *
 * Function Name: ENET_DRV_Calc_Crc32
 * Description: Calculate crc-32.
 * This function is called by the enet_mac_add_multicast_group and 
 * enet_mac_leave_multicast_group.
 *END*********************************************************************/
void ENET_DRV_Calc_Crc32(uint8_t *address, uint32_t *crcValue)
{
    uint32_t crc = ENET_ORIGINAL_CRC32, count1,count2;

    if ((!address) || (!crcValue))
    {
        return ;
    }
  
    /* Calculate the CRC-32 polynomial on the multicast group address*/
    for (count1 = 0; count1 < kEnetMacAddrLen; count1++)
    {
        uint8_t c = address[count1];
        for (count2 = 0; count2 < kEnetCrcOffset; count2++)
        {
            if ((c ^ crc)& 1U)
            {
                crc >>= 1U;
                c >>= 1U;
                crc ^= ENET_CRC32_POLYNOMIC;
            }
            else
            {
               crc >>= 1U;
               c >>= 1U;
            }
        }
    }

    *crcValue = crc;
}

/*FUNCTION****************************************************************
 *
 * Function Name: ENET_DRV_AddMulticastGroup
 * Return Value: The execution status.
 * Description: ADD ENET to the specific multicast group.
 * This function is used to add ENET device to specific multicast
 * group and it is called by the upper TCP/IP stack.
 *END*********************************************************************/
 uint32_t ENET_DRV_AddMulticastGroup(uint32_t instance, uint8_t *address, uint32_t *hash)
{
    uint32_t crcValue, baseAddr;

