jamesmunns/kinetis-rs/platform/drivers/enet/src/fsl_enet_driver.c
    /* Check input parameters*/
    if (!address)
    {
        return kStatus_ENET_InvalidInput;
    }
    baseAddr = g_enetBaseAddr[instance];
    /* Calculate the CRC-32 polynomial on the multicast group address*/
    ENET_DRV_Calc_Crc32(address, &crcValue);

    /* Set the hash table*/
    ENET_HAL_SetMulticastAddrHash(baseAddr, crcValue, kEnetSpecialAddressEnable);

    /* Store the hash value in the right address structure*/
    *hash = (crcValue >>= 26U) & kEnetCrcMask1;

    return kStatus_ENET_Success;
}

/*FUNCTION****************************************************************
 *
 * Function Name: ENET_DRV_Leave_MulticastGroup
 * Return Value: The execution status.
 * Description: ENET Leave specific multicast group.
 * This function is used to remove ENET device from specific multicast
 * group and it is called by the upper TCP/IP stack.
 *END*********************************************************************/
 uint32_t ENET_DRV_LeaveMulticastGroup(uint32_t instance, uint8_t *address)
{
    uint32_t crcValue, baseAddr;
    /* Check input parameters*/
    if (!address)
    {
        return kStatus_ENET_InvalidInput;
    }
    baseAddr = g_enetBaseAddr[instance];
    /* Calculate the CRC-32 polynomial on the multicast group address*/
    ENET_DRV_Calc_Crc32(address, &crcValue);

    /* Set the hash table*/
    ENET_HAL_SetMulticastAddrHash(baseAddr, crcValue, kEnetSpecialAddressDisable);
    
    return kStatus_ENET_Success;
}

/*FUNCTION****************************************************************
 *
 * Function Name: enet_mac_enqueue_buffer
 * Return Value: 
 * Description: ENET mac enqueue buffers.
 * This function is used to enqueue buffers to buffer queue.
 *END*********************************************************************/
void enet_mac_enqueue_buffer( void **queue, void *buffer)
{
    *((void **)buffer) = *queue;
    *queue = buffer;
}

/*FUNCTION****************************************************************
 *
 * Function Name: enet_mac_dequeue_buffer
 * Return Value: 
 * Description: ENET mac dequeue buffers.
 * This function is used to dequeue a buffer from buffer queue.
 *END*********************************************************************/
void *enet_mac_dequeue_buffer( void **queue)
{
    void *buffer = *queue;

    if (buffer) 
    {
        *queue = *((void **)buffer);
    }
    
    return buffer;
}


/*******************************************************************************
 * EOF
 ******************************************************************************/

